app/controllers/accounts_controller.rb

  def ajaxify_index
    @accounts = Account.all
---
SELECT * FROM "accounts"

  def ajaxify_new

    if(params[:new])
      @account = Account.create(:username => params[:username], :password => params[:password])
      @message = "Account Created"
    end
    @accounts = Account.all
---
INSERT INTO "accounts" ("created_at", "updated_at", "username", "password") VALUES('2010-07-10 15:47:17', '2010-07-10 15:47:17', 'temp.nav.chat', 'tempnavchat')
SELECT * FROM "accounts"

  def ajaxify

    @account = Account.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)

  def ajaxify_edit

    @account = Account.find(params[:id])

    if(params[:edit])
      @account.update_attribute("username", params[:username])
      @account.update_attribute("password", params[:password])
      @message = "Account Credentials Updated."
    end

    @accounts = Account.all
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
UPDATE "accounts" SET "updated_at" = '2010-07-10 16:18:19', "username" = 'po' WHERE "id" = 2
SELECT * FROM "accounts"

  def ajaxify_destroy

     @account = Account.find(params[:id])
     @account.destroy
     @accounts = Account.all
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 2)
DELETE FROM "accounts" WHERE "id" = 2
SELECT * FROM "accounts"

  def show
    @account = Account.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)

  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("created_at", "updated_at", "username", "password") VALUES('2010-07-07 12:38:40', '2010-07-07 12:38:40', 'temp.nav.chat', 'tempnavchat')

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 2)
DELETE FROM "accounts" WHERE "id" = 2