app/controllers/messages_controller.rb

  def index
    @messages = Message.all
    @accounts = Account.all
---
SELECT * FROM "messages"
SELECT * FROM "accounts"

  def get_mail
     require 'mail'
     require 'pop_ssl.rb'

     @account = Account.find(params[:username][:id])
     username = @account.username
     password = @account.password
     #search_terms = params[:search_terms].split(",")
     mail_ids = params[:mail_from].split(",")

     Mail.defaults do
        retriever_method :pop3, { :address             => "pop.gmail.com",
                                  :port                => 995,
                                  :user_name           => username,
                                  :password            => password,
                                  :enable_ssl          => true }
      end

      emails = Mail.all
      message_ids = []

      emails.each do |email|
          message_id = match_id(email,mail_ids)
          #only stores ids that are not nil
        if message_id != nil
          message_ids << message_id
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
INSERT INTO "messages" ("mail_from", "created_at", "body", "updated_at", "subject", "matched") VALUES('krishna.rokhale@gmail.com', '2010-07-08 06:37:55', 'woah', '2010-07-08 06:37:55', 'hiya', 'hiya,woah')

      def match_terms()


         tokens =  []


         params[:message_ids].each do |id|


           Message.find(id).subject.split(/[^-a-zA-Z]/).each do |word|
             tokens << word
           end

           Message.find(id).body.split(/[^-a-zA-Z]/).each do |word|
              tokens << word
            end

          end

          if params[:all_terms]
            search_terms = Term.all.collect(&:str)
---
SELECT * FROM "messages" WHERE ("messages"."id" = 2)
SELECT * FROM "terms"

  def show

    @messages = []
    if params[:message_ids]
      params[:message_ids].each do |id|
        @messages << Message.find(id)
      end
    end

    @terms = Term.all
---
SELECT * FROM "messages" WHERE ("messages"."id" = 7)
SELECT * FROM "terms"

  def search

    @accounts = Account.all
---
SELECT * FROM "accounts"

  def search_mail

     search_terms = params[:search_terms].split(",")
      mail_ids = params[:mail_from].split(",")

      messages_from_ids = messages_from_terms = []

      mail_ids.each do |id|
        messages_from_ids << Message.find_all_by_mail_from(id)
        messages_from_ids.flatten!
      end

      search_terms.each do |term|
        Message.all.each do |message|
---
SELECT * FROM "messages" WHERE ("messages"."mail_from" = 'krishna.rokhale@gmail.com')
SELECT * FROM "messages"