app/controllers/terms_controller.rb

SELECT * FROM "terms"
---
  def index
    @terms = Term.all

INSERT INTO "terms" ("created_at", "updated_at", "account_id", "str") VALUES('2010-07-10 16:59:11', '2010-07-10 16:59:11', 6, '1')
SELECT * FROM "accounts"
SELECT * FROM "accounts" WHERE ("accounts"."id" = 6)
---
  def ajaxify_new

     if params[:new]
       params[:str].split(",").each do |str|
       @term = Term.create(:str => str, :account_id => params[:account_id])
     end
     end

     @accounts = Account.all
     @account = Account.find(params[:account_id])

SELECT * FROM "terms" WHERE ("terms"."account_id" IS NULL)
DELETE FROM "terms" WHERE "id" = 3
SELECT * FROM "terms"
---
  def ajaxify_remove


    @terms = Term.find_all_by_account_id(params[:account_id])

    if(params[:remove])
      Term.destroy(params[:term_id])
      @message = "Term Deleted."
      @terms_after = Term.all

SELECT * FROM "terms" WHERE ("terms"."id" = 1)
---
  def show
    @term = Term.find(params[:id])

INSERT INTO "terms" ("created_at", "updated_at", "account_id", "str") VALUES('2010-07-09 03:38:32', '2010-07-09 03:38:32', NULL, 'test')
---
  def create
    @term = Term.new(params[:term])

    respond_to do |format|
      if @term.save